tap "homebrew/cask-versions"

brew "docker"
brew "go"
brew "gopass"
brew "graphviz"
brew "hugo"
brew "mas"
brew "nmap"
brew "p7zip"
brew "pinentry"
brew "pinentry-mac"
brew "pipx"
brew "pyenv"
brew "python"
brew "rbenv"
brew "speedtest-cli"
brew "terraform"
brew "terraform-docs"
brew "terraformer"
brew "tmux"
brew "travis"
brew "wakatime-cli"

cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "alfred"
cask "authy"
cask "basecamp"
cask "cheatsheet"
cask "dash"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keybase"
cask "kitematic"
cask "notion"
cask "omnigraffle"
cask "parallels"
cask "protonvpn"
cask "rectangle"
cask "setapp"
cask "signal"
cask "slack"
cask "spotify"
cask "tower"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "wireshark"
cask "yt-music"
cask "zoomus"

mas "Friendly Streaming", id: 553245401
mas "Core Tunnel", id: 1354318707
mas "Reeder", id: 880001334
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Jira", id: 1475897096