tap "chanzuckerberg/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "twilio/brew"
brew "coreutils"
brew "asdf"
brew "bash"
brew "ctags"
brew "desk"
brew "dmg2img"
brew "docker", link: false
brew "jpeg"
brew "libtiff"
brew "webp"
brew "ghi"
brew "ghq"
brew "git"
brew "git-lfs"
brew "gmailctl"
brew "pinentry"
brew "go"
brew "gopass"
brew "python"
brew "graphviz"
brew "gzip"
brew "hashcat"
brew "htop"
brew "hub"
brew "hugo"
brew "little-cms2"
brew "libxml2"
brew "node"
brew "joplin", link: false
brew "jq"
brew "jsonnet"
brew "libmagic"
brew "mas"
brew "nmap"
brew "p7zip"
brew "pinentry-mac"
brew "pipx"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "sipcalc"
brew "speedtest-cli"
brew "terraform"
brew "terraform-docs"
brew "terraformer"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "travis"
brew "tree"
brew "unzip"
brew "wakatime-cli"
brew "wget"
brew "zlib"
brew "zsh"
brew "chanzuckerberg/tap/fogg"
brew "github/gh/gh"
brew "mongodb/brew/mongodb-community"
brew "twilio/brew/twilio"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "aerial"
cask "alfred"
cask "authy"
cask "barrier"
cask "basecamp"
cask "cheatsheet"
cask "dash"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "dotnet-sdk"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "firefox-developer-edition"
cask "font-jetbrainsmono-nerd-font"
cask "franz"
cask "github"
cask "google-chrome"
cask "hey"
cask "iterm2"
cask "jetbrains-toolbox"
cask "joplin"
cask "keybase"
cask "kitematic"
cask "microsoft-office-2016"
cask "mindforger"
cask "mono-mdk-for-visual-studio"
cask "ngrok"
cask "notion"
cask "obs"
cask "obs-virtualcam"
cask "omnigraffle"
cask "openlp"
cask "parallels"
cask "powershell"
cask "protonvpn"
cask "rectangle"
cask "screens"
cask "scrivener"
cask "setapp"
cask "signal"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "tower2"
cask "transmit"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "whatsapp"
cask "wireshark"
cask "yt-music"
cask "zoomus"
mas "Core Tunnel", id: 1354318707
mas "Dynamo", id: 1445910651
mas "Friendly Streaming", id: 553245401
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Messenger", id: 1480068668
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 880001334
mas "Tailscale", id: 1475387142
mas "The Unarchiver", id: 425424353
