# Taps
tap 'github/gh' if OS.mac?
tap 'homebrew/cask-versions' if OS.mac?
tap 'homebrew/cask' if OS.mac?
tap 'homebrew/cask-fonts' if OS.mac?

# Dupes
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-which'
brew 'grep'
brew 'make'
brew 'rsync'
brew 'wget'

# Development
brew 'travis'
brew 'wakatime-cli'

# Utilities
brew 'bat'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'fselect'
brew 'fzf'
brew 'gopass'
brew 'htop'
brew 'hyperfine'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'ripgrep'
brew 'sd'
brew 'speedtest-cli'
brew 'tmux'
brew 'tokei'
brew 'watchexec'

# macOS Utilities
brew 'mas' if OS.mac?
brew 'osxutils' if OS.mac?
brew 'pinentry-mac' if OS.mac?
brew 'trash' if OS.mac?

# Information Utilities
brew 'howdoi'
brew 'tldr'
brew 'wtf'

# Shells
brew 'bash'
brew 'fish'
brew 'zsh'
brew 'antibody'
brew 'starship'

# Programming Languages
brew 'python'

# Utilities
brew 'direnv'
brew 'gnupg'
brew 'openssh'

# Git
brew 'git'
brew 'git-lfs'
brew 'gh'
brew 'ghi'
brew 'ghq'
brew 'hub'
brew 'lazygit'
brew 'pre-commit'

# Programming Tools
brew 'asdf'
brew 'bats-core'
brew 'shellcheck'

# Python Tools
# brew 'black'
# brew 'flake8'
# brew 'mkdocs'
# brew 'pipenv'

# IDEs & Editors
cask 'jetbrains-toolbox'
cask 'visual-studio-code'

# Virtualization
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vmware-fusion'

# Images
brew 'imagemagick'
brew 'jpeg'
brew 'libtiff'
brew 'webp'

# Casks
cask '1password'
cask '1password-cli'
cask 'adoptopenjdk'
cask 'aerial'
cask 'alfred'
cask 'cheatsheet'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrainsmono-nerd-font'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iterm2'
cask 'mactex'
cask 'microsoft-office-2016'
cask 'microsoft-teams'
cask 'postgres'
cask 'setapp'
cask 'slack'
cask 'spotify'
cask 'transmit'
cask 'whatsapp'
cask 'wireshark'
cask 'yt-music'
cask 'zoomus'

# Mac App Store
mas 'Core Tunnel', id: 1354318707
mas 'Friendly Streaming', id: 553245401
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Jira', id: 1475897096
mas 'Keynote', id: 409183694
mas 'Meeter', id: 1510445899
mas 'Messenger', id: 1480068668
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Reeder', id: 880001334
mas 'Tailscale', id: 1475387142
mas 'The Unarchiver', id: 425424353